String sex = ""; //성별
String age = "";  //나이 => 연령대로 입력 ex)40대, 50대
int Height=0,Weight=0; // 키, 몸무게 => 5단위 정수로 입력
String complaint = ""; //증상 ex)배가 아파요
String onset = ""; //증상 발현 시기 ex) 2일전, 3시간전
String location = ""; //증상 위치 ex) 명치, 복부
String Associated = ""; //추가 증상
int needDiag = 0;

/*
"Duration": "지속",
"Course": "심해짐",
"Experience": "이전에도 3차례, 통증은 이번보다 약했음",
"Character": "칼로 찢기는 듯한 통증, 통증 심함, 방사통(#), 등으로 퍼짐,",
"Factor": "자세에 따른 변화(#), 오른쪽으로 돌아 누우면 완화, 반듯이 누우면 악화,",
"Event": "없음",
"약물 투약력": "없음",
"사회력": "술(#), 1주일 6~7번, 하루 소주 2~3병, 담배(#), 30갑년, 식사 , 매우 불규칙, 직업 , 포크레인 조종수,",
"가족력": "없음",
"외상력": "없음",
"과거력": "없음",
"여성력": "없음",
"BMI": 27.6816609,
"Obesity": "과체중",
*/